dataset_gen/NS_Gauss_Irr_openfoam/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16320
(
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    holeWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.472656
0.480469
0.488281
0.496094
0.503906
0.511719
0.519531
0.527344
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
